tests/fixtures/finalized_invoice_index.json

{
  "finalized_invoices": [
    {
      "month": "2023-11-01T00:00:00.000Z",
      "amount_cents": 100,
      "currency": "EUR",
      "invoices_count": 10,
      "payment_status": "pending"
    },
    {
      "month": "2023-12-01T00:00:00.000Z",
      "amount_cents": 200,
      "currency": "USD",
      "invoices_count": 5,
      "payment_status": "pending"
    }
  ],
  "meta": {}
}
